/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_cub_cl_tex_for_parse_bonus.c                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: aberry <aberry@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/27 13:45:02 by aberry            #+#    #+#             */
/*   Updated: 2020/12/20 15:57:27 by aberry           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../include/cub3d_bonus.h"

/*
**---------------------->>>>ft_cub_cl_tex_for_parse.c<<<<----------------------
** " > " - Вход в функцию
**
** -------------------------->>>>ft_cub_texture.c<<<<--------------------------
** Проверяем что дано две подстроки и не более, а также что параметр уже не
** был заполнен.
** ----------------------------------------------------------------------------
** Проверяем что начало строки состоит из "./" и что ее длина больше трех, тк
** это путь до текстуры.
** ----------------------------------------------------------------------------
** Записываем строку в структуру
**
** -------------------------->>>>ft_cub_texture.c<<<<--------------------------
** Проверяем что дано две подстроки и не более, а также что параметр уже не
** был заполнен.
** ----------------------------------------------------------------------------
** Проверяем что дано три подстроки из str[2] (Пример: 220,100,0).
** ----------------------------------------------------------------------------
** Заполняем временный массив числами из подстрок color и переводим в HEX.
** ----------------------------------------------------------------------------
** Проверяем что числа в диапозоне [0,255].
** ----------------------------------------------------------------------------
** Переводим в 16ричную + 0х и записываем в map.
** ----------------------------------------------------------------------------
*/

int	ft_cub_texture(char **str, char **map)
{
	if (!ft_check_value(str, 2) || *map)
		return (ft_error_massage("No valid texture path\n", 22));
	if (ft_strncmp(str[1], "./", 2) || ft_strlen(str[1]) < 3)
		return (ft_error_massage("No valid texture path\n", 22));
	*map = ft_strdup(str[1]);
	return (0);
}

int	ft_create_hex(int t, int r, int g, int b)
{
	return (t << 24 | r << 16 | g << 8 | b);
}

int	ft_cub_color(char **str, int *map)
{
	char	**color;
	int		c_nums[3];
	int		i;

	i = -1;
	if (!ft_check_value(str, 2) || *map != -1)
		return (ft_error_massage("No valid data\n", 14));
	if (!(color = ft_split(str[1], ',')) || !ft_check_value(color, 3))
		return (ft_error_massage("No valid data\n", 14));
	while (++i < 3)
		if ((c_nums[i] = ft_atoi_cub(color[i])) < 0)
			return (ft_error_massage("Colors no valid\n", 16));
	ft_clear(color);
	while (++i < 7)
		if (!(c_nums[i - 4] < 256 && c_nums[i - 4] > -1))
			return (ft_error_massage("Colors must be in range [0,255]\n", 32));
	*map = ft_create_hex(0, c_nums[0], c_nums[1], c_nums[2]);
	return (0);
}
